/*
* This file is dedicated to uploading the short thai version of the explanatory statement onto the firestore
* */

function uploadExplanatoryStatement_th_short(){
    let contents = "<center><b>(กลุ่มผู้เข้าร่วมสำรวจ)</b></center><br>" +
        "<center><b>MUHREC Project ID: 29459</b><br>" +
        "<b>อีเมลโครงการ: </b>womenintech@monash.edu</center><br>" +
        "<b>Professor Teh Pei Lee</b><br>" +
        "คณะบริหารธุรกิจ<br>" +
        "โทรศัพท์: +603-55144971<br>" +
        "อีเมล: teh.pei.lee@monash.edu<br><br>" +
        "<b>Dr Ewilly Liew Jie Ying</b><br>" +
        "คณะบริหารธุรกิจ<br>" +
        "โทรศัพท์: +603-55145872<br>" +
        "อีเมล: ewilly.liew@monash.edu<br><br>" +
        "<b>การวิจัยเกี่ยวข้องกับอะไร?</b><br>" +
        "เราต้องการเข้าใจความต้องการและการรับรู้ของคุณเกี่ยวกับการเรียนรู้โดยใช้แอปพลิเคชันมือถือ คุณได้รับเชิญให้ตอบแบบสอบถาม แชทบอทในแอปพลิเคชั" +
        "นมือถือที่พัฒนาโดยนักวิจัย Monash Malaysia ซึ่งจะใช้เวลาประมาณ 15 – 30 นาที<br><br>" +
        "<b>ใครสามารถทำแบบสำรวจให้เสร็จได้? เปิดรับผู้หญิงทุกคนที่มีอายุ70ปีขึ้นไปเท่านั้น" +
        "การถอน: </b>คุณสามารถถอนได้ตลอดเวลาระหว่างระยะเวลาการสำรวจ หรือรับแบบสำรวจในภายหลังจากตำแหน่งที่คุณไปจากความพยายามครั้งล่าสุด<br><br>" +
        "<b>การชำระเงิน: </b>คุณจะได้รับโทเค็นแสดงความขอบคุณเป็นเงินสด <b>RM50</b> เมื่อทำแบบสำรวจเสร็จสิ้น<br>" +
        "<b>การรักษาข้อมูลส่วนตัว: </b>แบบสำรวจไม่ระบุชื่อ คำตอบทั้งหมดที่คุณให้ไว้จะไม่เปิดเผย ในตอนท้ายของแบบสำรวจ คุณจะถูกเปลี่ยนเส้นทางไปยังแบ" +
        "บฟอร์ม Qualtrics อื่นและขอข้อมูลเพิ่มเติมสองรายการ (1) คุณมีทางเลือกในการเลือกรับการติดต่อทางหมายเลขโทรศัพท์มือถือของคุณสำหรับโครงกา" +
        "รวิจัย (ที่เกี่ยวข้อง) ในอนาคตที่ได้รับการอนุมัติทางจริยธรรม (2) คุณมีทางเลือกในการตัดสินใจว่าต้องการรับเงินคืนด้วยวิธีใดโดยให้ (ก) " +
        "รายละเอียดธนาคารออนไลน์ หรือ (ข) รายละเอียดกระเป๋าเงินอิเล็กทรอนิกส์ หรือ (ค) ยุติการสำรวจ ข้อมูลเพิ่มเติมจะถูกเก็บไว้แยกต่างหากและจะ" +
        "ไม่เชื่อมโยงกับคำตอบแบบสำรวจแชทบ็อตของคุณ หลังจากการเบิกจ่ายเงินสด ข้อมูลการชำระเงินทั้งหมดจะถูกลบออกจากแพลตฟอร์ม Qualtrics " +
        "อย่างถาวร โปรดดูคำชี้แจงสิทธิ์ส่วนบุคคลของ " +
        "<a href='https://www.qualtrics.com/privacy-statement/' target='_blank'>Qualtrics</a>" +
        " สำหรับข้อมูลเพิ่มเติม<br><br>" +
        "<b>ผลการสำรวจ: </b>จะไม่มีการรายงานผลของแต่ละบุคคล เฉพาะผลลัพธ์ที่ไม่ระบุตัวตนโดยรวมเท่านั้นที่จะเผยแพร่ในวารสารที่ผ่านการตรวจสอบโ" +
        "ดยเพื่อน หนังสือ/บทของหนังสือ และนำเสนอในที่ประชุม ผู้เข้าร่วมสามารถติดต่อหัวหน้าผู้วิจัยเพื่อทราบผลการวิเคราะห์<br><br>" +
        "<b>การร้องเรียน: </b>สำหรับข้อกังวลด้านจริยธรรมหรือข้อร้องเรียนเกี่ยวกับการดำเนินการของโครงการ โปรดติดต่อ Monash University " +
        "Human Research Ethics Committee ที่ muhrec@monash.edu หรือ Ms. Jocelyn Fam จาก Quality and Governance, " +
        "Monash University Malaysia ที่โทรศัพท์: (+603) 5514 5664 หรืออีเมล: jocelyn.fam@monash.edu<br><br>" +
        "โปรดทราบว่า การทำแบบสำรวจต่อแสดงว่าคุณยินยอมที่จะมีส่วนร่วมในการวิจัยนี้ และยอมรับข้อมูลที่ให้ไว้ในคำชี้แจงคำอธิบาย<br><br>" +
        "<a href='./explanatoryStatementLongPage.html'>ลิงก์ไปยังคำชี้แจงแบบยาว</a>"

    firebase.firestore().collection("ExplanatoryStatement").doc("ExplanatoryStatement_th_short").set({
        contents: contents
    })
        .then(() => {
            console.log("Document successfully written!");
        })
        .catch((error) => {
            console.error("Error writing document: ", error);
        });
}