/*
* This file is dedicated to uploading the english version of the terms of use onto the firestore
* */

function uploadTermsOfUse_th(){
    let contents = "<h4>ข้อตกลงเงื่อนไขการใช้งาน</h4>" +
        "ข้อกำหนดการใช้งานและเงื่อนไขนี้ เรียกว่า\"ข้อกำหนดการใช้งาน\" ถือเป็นข้อตกลงที่มีผลผูกพันทางกฎหมายระหว่าง \"คุณ\" และ Women-in-tech " +
        "ในที่นี้คือ \"บริษัท\" \"เรา\"หรือ \"ของเรา\" โดยเป็นการคำนึงถึงการเข้าถึงและการใช้งานบนเว็บไซต์ Women-in-tech ตลอดจนรูปแบบสื่อ " +
        "(media form) ที่เกี่ยวข้อง ทั้งช่องทางสื่อ (media channel)  เว็บ Women-in-tech บนมือถือ (mobile web) แอปพลิเคชันบนมือถือ " +
        "(mobile application) หรือส่วนที่เชื่อมโยงกันกับแอปพลิเคชัน (รวมเรียกว่า \"Women-in-tech\") ทั้งนี้ คุณยอมรับว่าในการเข้าถึง " +
        "Women-in-tech คุณได้อ่าน ทำความเข้าใจ และตกลงที่จะผูกพันตามข้อกำหนดการใช้งานทั้งหมด " +
        "หากคุณไม่เห็นด้วยกับข้อกำหนดการใช้งานทั้งหมดเหล่านี้ คุณจะได้รับการคัดค้านจากการใช้งาน WOMEN-IN-TECH และคุณต้องต้องยุติการใช้งานโดยทันที" +
        "<br><br>" +
        "ข้อกำหนดและเงื่อนไขเพิ่มเติมหรือเอกสารที่อาจเผยแพร่ในแพลตฟอร์ม Women-in-tech ที่แม้จะเป็นครั้งคราวให้รวมไว้ในที่นี้อย่างชัดแจ้งโดยการอ้างอิง" +
        " ทางเราขอสงวนสิทธิ์การใช้ดุลยพินิจในการเปลี่ยนแปลงหรือแก้ไขข้อกำหนดการใช้งานได้ตลอดเวลาไม่ว่าจะด้วยเหตุผลใด อนึ่ง " +
        "เราจะแจ้งให้คุณทราบเกี่ยวกับการเปลี่ยนแปลงที่ได้ดำเนินการ พร้อมการแจ้งวันที่ปรับปรุงล่าสุด \"ปรับปรุงล่าสุด\" ในข้อกำหนดการใช้งาน " +
        "โดยคุณสามารถสละสิทธิ์การได้รับการแจ้งเตือนการเปลี่ยนแปลงข้อกำหนดการใช้งาน ทั้งนี้ขึ้นอยู่กับความรับผิดชอบของคุณต่อการตรวจสอบข้อกำหนดการใช้" +
        "งานเพื่อรับทราบข้อมูลที่ปรับปรุงล่าสุดเป็นระยะโดยจะต้องปฏิบัติตามข้อกำหนดดังกล่าวที่จะถือได้ว่าเป็นการรับทราบและยอมรับการเปลี่ยนแปลงแก้ไขข้อก" +
        "ำหนดการใช้งาน โดย Women-in-tech จะดำเนินใดๆ หลังจากวันที่มีการเผยแพร่การแก้ไขข้อกำหนดการใช้งาน และขอให้รับทราบและยอมรับว่าข้อมูล" +
        "ที่ได้ให้ไว้ใน Women-in-tech ไม่ได้มีวัตถุประสงค์เพื่อแจกจ่ายหรือสามารถที่จะนำไปใช้โดยบุคคลหรือนิติบุคคลทั้งในเขตอำนาจศาลประเทศใดๆ " +
        "โดยที่การแจกจ่ายหรือการใช้งานขัดต่อกฎหมายหรือระเบียบข้อบังคับ รวมไปถึงกรณีที่เป็นเหตุให้ทางเราจำเป็นต้องแสดงตนภายในเขตอำนาจศาลประเ" +
        "ทศดังกล่าว ดังนั้นบุคคลผู้เข้าถึง Women-in-tech จากสถานที่อื่นใดจะต้องเป็นผู้รับผิดชอบแต่เพียงผู้เดียวต่อการปฏิบัติตามกฎหมายในขอบเขตพื้นที่กฎหม" +
        "ายมีผลบังคับใช้ ทั้งนี้ Women-in-tech มีไว้สำหรับผู้ใช้ที่มีอายุอย่างน้อย 18 ปี ผู้ที่มีอายุต่ำกว่า 18 ปีจะไม่ได้รับการอนุญาตให้ใช้หรือลงทะเบียนสำห" +
        "รับการใช้งาน Women-in-tech"+
        "<h4>สิทธิทรัพย์สินทางปัญญา</h4>" +
        "เว้นเสียแต่ว่าจะมีการระบุไว้เป็นอย่างอื่น ให้ถือว่า Women-in-tech เป็นทรัพย์สินที่เป็นกรรมสิทธิ์ของเรารวมไปถึงรหัสต้นฉบับ (source code) " +
        "ฐานข้อมูล (databases) ฟังก์ชันการทำงาน (functionality) ซอฟต์แวร์ (software) การออกแบบเว็บ Women-in-tech (designs) " +
        "เสียง (audio) วิดีโอ (video)  ข้อความ (text) รูปถ่าย (photographs) และกราฟิก (graphics) ทั้งหมดในแอพลิเคชั่น Women-in-app " +
        "(รวมเรียกว่า \"เนื้อหา\") และเครื่องหมายการค้า เครื่องหมายบริการ และโลโก้ (รวมเรียกว่า\"เครื่องหมาย\") ให้นับว่าเป็นของเราหรือควบคุ" +
        "มโดยเราหรือจะต้องได้รับอนุญาตจากเรา ภายใต้การคุ้มครองในขอบเขตของกฎหมายลิขสิทธิ์และเครื่องหมายทางการค้า สิทธิ์ในทรัพย์สินทางปัญญา " +
        "รวมถึงกฎหมายลิขสิทธิ์และอนุสัญญาระหว่างประเทศในเนื้อหาและเครื่องหมายต่อข้อกำหนดการใช้งาน โดย ห้ามคัดลอก ทำซ้ำ รวบรวม ตีพิมพ์ซ้ำ " +
        "อัปโหลด โพสต์ เผยแพร่ต่อสาธารณะ เข้ารหัส แปล ส่งผ่าน แจกจ่าย ขาย อนุญาต หรือนำไปใช้เพื่อวัตถุประสงค์ทางการค้าใดๆ โดยไม่ได้รับอนุญาตเ" +
        "ป็นลายลักษณ์อักษรล่วงหน้าจากเรา<br><br>" +
        "หากคุณมีสิทธิ์ใช้ Women-in-tech คุณจะถูกจำกัดการอนุญาตการเข้าถึงการใช้งาน การดาวน์โหลดหรือสำเนาของเนื้อหาส่วนใดที่สามารถเข้าถึงเพื่อกา" +
        "รใช้งานส่วนบุคคลเท่านั้นโดยมิใช่การใช้งานเชิงพาณิชย์ ทางเราขอสงวนสิทธิ์ทั้งหมดทั้งในส่วนของเนื้อหาและเครื่องหมาย " +
        "<h4>ตัวแทนผู้ใช้งาน</h4>" +
        "ในการใช้งาน Women-in-tech คุณรับรองและรับประกันว่า: (1) ข้อมูลการลงทะเบียนทั้งหมดของคุณเป็นความจริง ถูกต้อง เป็นข้อมูลปัจจุบัน และครบ" +
        "ถ้วนสมบูรณ์ 2) หากมีความจำเป็นคุณจะยืนยันความถูกต้องของข้อมูลและปรับปรุงข้อมูลการลงทะเบียนให้ถูกต้อง 3) สถานะของคุณเป็นไปตามการรับรอง" +
        "ทางกฎหมายและคุณยินดีที่จะปฏิบัติตามข้อกำหนดการใช้งาน (4) คุณไม่ใช่ผู้เยาว์ในเขตอำนาจศาลที่คุณอาศัยอยู่ 5) คุณจะไม่เข้าถึง Women-in-tech " +
        "ด้วยวิธีการอัตโนมัติอื่นใดที่ไม่ใช่โดยการกระทำของมนุษย์ ไม่ว่าเป็นการใช้งานผ่านบอท (bot) สคริปต์ (script) หรืออื่นๆ (6) คุณจะไม่ใช้ " +
        "Women-in-tech ในวัตถุประสงค์ผิดกฎหมายหรือในกรณีที่ไม่ได้รับอนุญาต และ (7) การใช้ Women-in-tech ของคุณจะต้องไม่ละเมิดกฎหมายหรือข้อบั" +
        "งคับอื่นใดหากคุณให้ข้อมูลเท็จ ไม่ถูกต้อง ไม่ใช่ข้อมูลที่เป็นปัจจุบัน หรือไม่สมบูรณ์ ทางเรามีสิทธิ์ที่จะระงับหรือยุติบัญชีใช้งานของคุณ และปฏิเสธการใช้งาน " +
        "Women-in-tech ทั้งในปัจจุบันหรืออนาคต (รวมถึงส่วนหนึ่งส่วนใดของข้อมูลดังกล่าว)" +
        "<h4>การลงทะเบียนผู้ใช้งาน</h4>" +
        "เมื่อคุณลงทะเบียนกับ Women-in-tech คุณตกลงที่จะเก็บรหัสผ่านไว้เป็นความลับและจะต้องรับผิดชอบต่อการใช้บัญชีและรหัสผ่านทั้งหมด เราขอสงวนสิ" +
        "ทธิ์ในการใช้ดุลยพินิจพิจารณาหากเกิดความไม่เหมาะสมของการใช้งานที่เข่าข่ายการกระทำผิด การกระทำลามกอนาจาร หรือเป็นการกระทำที่ไม่ได้รับกา" +
        "รยอมรับในสังคม ในการลบ เรียกคืน หรือเปลี่ยนชื่อผู้ใช้ที่คุณได้ดำเนินการไว้ " +
        "<h4>กิจกรรมต้องห้าม</h4>" +
        "ในกรณีที่คุณลงทะเบียนใช้งาน Women-in-tech เพื่อวัตถุประสงค์นอกเหนือจากที่บริษัทกำหนด การใช้งานนั้นจะถูกห้ามมิให้ใช้ในเชิงพาณิชย์ไม่ว่ากรณีใดๆ " +
        "ยกเว้นหากทางบริษัทได้มีการรับรองหรืออนุมัติเป็นการเฉพาะ" +
        "<br><br>" +
        "ในฐานะผู้ใช้งาน Women-in-tech คุณตกลงที่จะไม่ดำเนินการใดๆ ดังต่อไปนี้:" +
        "<br><br>" +
        "1. ดึงข้อมูลหรือเนื้อหาอื่นๆ จาก Women-in-tech อย่างเป็นระบบเพื่อสร้างหรือรวบรวมฐานข้อมูลไม่ว่าโดยตรงหรือโดยอ้อม โดยไม่ได้รับอนุญาตเป็นลายลักษณ์อักษรจากบริษัท<br><br>" +
        "2. หลอกลวง ฉ้อโกง หรือหลอกลวงบริษัทและผู้ใช้รายอื่น โดยเฉพาะอย่างยิ่งในการพยายามที่จะล่วงรู้ถึงข้อมูลบัญชีที่มีความละเอียดอ่อน เช่น รหัสผ่านของผู้ใช้งาน<br><br>" +
        "3. หลีกเลี่ยง ปิดการใช้งาน หรือแทรกแซงคุณสมบัติที่เกี่ยวข้องกับความปลอดภัยของ Women-in-tech รวมถึงคุณสมบัติที่ป้องกันหรือจำกัดการใช้ หรือคัดลอกเนื้อหาใดๆ ในข้อจำกัดการใช้งาน Women-in-tech และ/ หรือเนื้อหาที่อยู่ในนั้น<br><br>" +
        "4. ดูหมิ่น ทำให้เสื่อมเสีย หรือทำให้เกิดอันตรายอื่นใดตามการดุลยพินิจทางบริษัทหรือ Women-in-tech<br><br>" +
        "5. ใช้ข้อมูลใดๆ จาก Women-in-tech เพื่อก่อกวน ล่วงละเมิด หรือทำร้ายผู้อื่น<br><br>" +
        "6. ใช้บริการสนับสนุนของเราอย่างไม่เหมาะสม ละเมิด ให้ข้อมูลเท็จ หรือประพฤติมิชอบ<br><br>" +
        "7. ใช้ Women-in-tech ในลักษณะที่ฝ่าฝืนบทบัญญัติทางกฎหมายหรือข้อบังคับใช้<br><br>" +
        "8. ใช้ Women-in-tech เพื่อโฆษณาหรือในเชิงพาณิชย์<br><br>" +
        "9. มีส่วนร่วมในการใช้งานโดยมิชอบหรือเชื่อมโยงกับ Women-in-tech โดยไม่ได้รับอนุญาต<br><br>" +
        "10. อัปโหลดหรือส่ง (หรือพยายามอัปโหลดหรือส่ง) ไวรัสม้าโทรจัน (Trojan horses) หรือเนื้อหาอื่น ๆ รวมถึงการใช้ตัวพิมพ์ใหญ่และสแปมมากเ" +
        "กินไป (การโพสต์ข้อความซ้ำ ๆ อย่างต่อเนื่อง) รบกวนการใช้งานและความเพลิดเพลินของฝ่ายใดฝ่ายหนึ่งอย่างต่อเนื่องหรือดัดแปลง บั่นทอน ขัดขวาง " +
        "เปลี่ยนแปลง หรือรบกวนการใช้งานคุณลักษณะฟังก์ชันการทำงานหรือการคงสภาพของ Women-in-tech<br><br>" +
        "11. มีส่วนร่วมในการใช้งานระบบอัตโนมัติ เช่น การใช้สคริปต์ (scripts) เพื่อส่งความคิดเห็น (comment) หรือส่งข้อความ หรือใช้เหมืองข้อมูล " +
        "(data mining) หุ่นยนต์ (robot) หรือเครื่องมือรวบรวมและดึงข้อมูล<br><br>" +
        "12. ลบประกาศเกี่ยวกับลิขสิทธิ์หรือกรรมสิทธิ์อื่นๆ ออกจากเนื้อหา<br><br>" +
        "13. พยายามปลอมแปลงเป็นผู้ใช้หรือบุคคลอื่นหรือใช้ชื่อผู้ใช้ของผู้ใช้รายอื่น<br><br>" +
        "14. ขายหรือโอนบัญชีโปรไฟล์ของคุณ<br><br>" +
        "15. อัปโหลดหรือส่ง (หรือพยายามอัปโหลดหรือส่ง) เนื้อหาใดๆ ที่ทำหน้าที่เป็นกลไกการเก็บรวบรวมหรือส่งข้อมูล รวมถึงแต่ไม่จำกัดเพียงรูปแบบการแล" +
        "กเปลี่ยนกราฟิกที่มีความละเอียด (\"gifs\"), 1×1 พิกเซล, เว็บบั๊ก , คุกกี้ หรืออุปกรณ์อื่นๆ ที่คล้ายคลึงกัน (บางครั้งเรียกว่า \"สปายแวร์\" หรือ " +
        "\"กลไกการรวบรวมแบบพาสซีฟ\" หรือ \"pcms\") ในลักษณะผู้กระทำการหรือผู้ร่วมกระทำการ<br><br>" +
        "16. แทรกแซง ขัดขวาง หรือสร้างภาระที่ไม่เหมาะสมแก่ Women-in-tech หรือเครือข่ายหรือบริการที่เชื่อมต่อกับ Women-in-tech<br><br>" +
        "17. ก่อกวน สร้างความรำคาญ ข่มขู่ หรือคุกคามพนักงานหรือตัวแทนของเราที่มีส่วนร่วมในการให้บริการ Women-in-tech<br><br>" +
        "18. พยายามที่จะเลี่ยงมาตรการใดๆ ของ Women-in-tech ที่ออกแบบมาเพื่อป้องกันหรือจำกัดการเข้าถึง Women-in-tech หรือส่วนใดส่วนหนึ่งของ Women-in-tech<br><br>" +
        "19. คัดลอกหรือดัดแปลงซอฟต์แวร์ของ Women-in-tech ซึ่งรวมถึงแต่ไม่จำกัดเพียง Flash, PHP, HTML, JavaScript หรือโค้ดอื่นๆ<br><br>" +
        "20. ถอดรหัส ถอดส่วนประกอบ หรือกระทำการวิศวกรรมย้อนกลับซอฟต์แวร์ใดๆ ที่ประกอบด้วยหรือประกอบขึ้นอันเป็นส่วนหนึ่งของ Women-in-tech<br><br>" +
        "21. ยกเว้นที่อาจเป็นผลจากการใช้เสิร์ชเอนจินทั่วไป (search engine) หรือ การใช้อินเทอร์เน็ตเบราว์เซอร์ การใช้งานเปิดตัว พัฒนา หรือแจกจ่า" +
        "ยระบบอัตโนมัติใดๆ รวมถึงแต่ไม่จำกัดเพียงการใช้วิธีการโดยโครงประกอบตัวหมุน (spider) การใช้หุ่นยนต์ โปรแกรมโกง การดึงข้อมูล หรือโปรแกร" +
        "มอ่านออฟไลน์ที่เข้าถึง Women-in-tech หรือใช้/เปิดสคริปต์หรือใช้ซอฟต์แวร์อื่นๆ โดยที่ไม่ได้รับอนุญาต<br><br>" +
        "22. ใช้ตัวแทนซื้อหรือตัวแทนจัดซื้อเพื่อซื้อสินค้าใน Women-in-tech<br><br>" +
        "23. ใช้งาน Women-in-tech โดยไม่ได้รับอนุญาต รวมถึงการรวบรวมชื่อผู้ใช้และ/หรือที่อยู่อีเมลของผู้ใช้ด้วยวิธีการทางอิเล็กทรอนิกส์หรือวิธีการอื่นเพื่" +
        "อวัตถุประสงค์ในการส่งอีเมลที่ไม่พึงประสงค์ หรือสร้างบัญชีผู้ใช้ด้วยวิธีการอัตโนมัติหรือภายใต้การหลอกลวง<br><br>" +
        "24. ใช้ Women-in-tech ในทางการแข่งขันกับเราหรือพยายามใช้ Women-in-tech และ/หรือเนื้อหาในการสร้างรายได้หรือใช้กับองค์กรการค้าใดๆ" +
        "<h4>การมีส่วนร่วมในผลงานที่ผู้ใช้งานสร้างขึ้น</h4>" +
        "Women-in-tech ไม่มีการเสนอให้ผู้ใช้งานส่งหรือโพสต์เนื้อหา โดยที่ทางเราอาจเปิดโอกาสให้คุณสามารถสร้าง ส่ง โพสต์ แสดง ดำเนินการ เผยแพร่ " +
        "แจกจ่าย หรือเผยแพร่เนื้อหาและสื่อต่างๆ แก่ทางเราหรือบน Women-in-tech ซึ่งรวมถึงแต่ไม่จำกัดเพียงข้อความ งานเขียน วิดีโอ เสียง ภาพถ่าย " +
        "กราฟิก ความคิดเห็น ข้อเสนอแนะ หรือข้อมูลส่วนบุคคลหรือเนื้อหาอื่น ๆ (รวมเรียกว่า \"ผลงาน\") ทั้งนี้ หากมีผลงานที่สามารถดูได้โดยผู้ใช้งานบน " +
        "Women-in-tech หรือบุคคลอื่นๆ ผ่าน เว็บ Women-in-tech ผลงานใดๆ ที่คุณส่งต่ออาจได้รับการปฏิบัติตามนโยบายความเป็นส่วนตัวของ " +
        "Women-in-tech ดังนั้นเมื่อคุณสร้างหรือจัดให้มีการเข้าถึงผลงาน คุณรับรองและรับประกันว่า:<br><br>" +
        "1. การสร้าง แจกจ่าย ส่งต่อ การแสดงต่อสาธารณะ หรือการแสดงและการเข้าถึง การดาวน์โหลด หรือคัดลอกผลงานของคุณจะต้องไม่ละเมิดสิทธิ์ใน" +
        "กรรมสิทธิ์ ซึ่งรวมถึงแต่ไม่จำกัดเพียงลิขสิทธิ์ สิทธิบัตร เครื่องหมายการค้า ความลับทางการค้า หรือสิทธิในทางศีลธรรมของบุคคลอื่นที่เกี่ยวข้อง<br><br>" +
        "2. หากคุณเป็นผู้สร้างผลงานและเป็นเจ้าของหรือได้รับใบอนุญาตตาม สิทธิบัตร ตามสิทธิและความยินยอม ในการปล่อยและอนุญาตให้ใช้และอนุญาตให้เรา " +
        "Women-in-tech และผู้ใช้อื่น ๆ ของ Women-in-tech ใช้ผลงานของคุณ ในการมีส่วนร่วมในลักษณะใดก็ตาม Women-in-tech จะเป็นผู้พิจารณาและ" +
        "ข้อกำหนดการใช้งานเหล่านี้<br><br>" +
        "3. คุณได้รับการยินยอมเป็นลายลักษณ์อักษร ในการเผยแพร่และ/หรือการอนุญาตรายบุคคลและทุกบุคคลที่ปรากฏในผลงานของคุณในการใช้ชื่อหรือใช้ชื่อที่คล้" +
        "ายคลึงกันกับแต่ละบุคคล เพื่อใช้ในการรวบรวมการใช้ผลงานของคุณโดยที่จะเป็นไปในลักษณะตามที่ Women-in-tech จะเป็นผู้พิจารณาตามกำหนดการใช้" +
        "งานเหล่านี้<br><br>" +
        "4. ผลงานของคุณจะต้องไม่เป็นเท็จ ไม่ถูกต้อง หรือต้องไม่เป็นไปในทางที่ผิด <br><br>" +
        "5. ผลงานของคุณจะต้องไม่ใช้เพื่อการโฆษณาที่ไม่พึงประสงค์หรือไม่ได้รับอนุญาต หรือเป็นสื่อส่งเสริมการขาย แผนธุรกิจแบบพีระมิด จดหมายลูกโซ่ สแปม " +
        "การส่งจดหมายจำนวนมาก หรือการชักชวนในรูปแบบอื่นๆ<br><br>" +
        "6. ผลงานของคุณไม่เป็นไปในทางลามกอนาจาร รุนแรง ก่อกวน หมิ่นประมาท ใส่ร้าย หรือเป็นไปในทางที่ผิด (ตามที่ทางบริษัทพิจารณา)<br><br>" +
        "7. ผลงานของจะต้องไม่เป็นไปในทางการเยาะเย้ย ดูหมิ่น ข่มขู่ หรือเป็นการล่วงละเมิดผู้ใด<br><br>" +
        "8. ผลงานของคุณต้องไม่เป็นไปในทางการสนับสนุนการใช้ความรุนแรงโค่นล้มรัฐบาลหรือยุยง ส่งเสริม หรือคุกคามการทำร้ายร่างกายผู้ใด<br><br>" +
        "9. ผลงานของคุณไม่ละเมิดกฎหมาย ข้อบังคับ หรือกฎเกณฑ์ใดๆ ที่บังคับใช้<br><br>" +
        "10. ผลงานของคุณไม่ละเมิดความเป็นส่วนตัวหรือสิทธิ์ในการประชาสัมพันธ์ของผู้อื่น<br><br>" +
        "11. ผลงานของคุณไม่มีเนื้อหาใด ๆ ที่ขอข้อมูลส่วนบุคคลจากผู้ใดก็ตามที่มีอายุต่ำกว่า 18 ปี หรือรวมถึงการหาประโยชน์จากผู้ที่มีอายุต่ำกว่า 18 ปีในลักษณะทางเพศหรือความรุนแรง<br><br>" +
        "12. ผลงานของคุณไม่ละเมิดกฎหมายที่บังคับใช้เกี่ยวกับภาพอนาจารของเด็ก หรือมีวัตถุประสงค์เพื่อคุกคามสุขภาพหรือสวัสดิภาพของผู้เยาว์<br><br>" +
        "13. ผลงานคุณจะไม่เป็นไปในทางการแสดงความคิดเห็นที่ไม่เหมาะสมที่เกี่ยวข้องกับเชื้อชาติ ชาติกำเนิด เพศ รสนิยมทางเพศ หรือความพิการทางร่างกาย<br><br>" +
        "14. ผลงานของคุณไม่ละเมิดหรือเชื่อมโยงไปกับการละเมิดข้อกำหนดใด ๆ ของข้อกำหนดการใช้งานหรือกฎหมายหรือข้อบังคับที่บังคับใช้<br><br>" +
        "การใช้ Women-in-tech ใดๆ ที่เป็นการละเมิดดังที่กล่าวมาข้างต้นถือเป็นการละเมิดข้อกำหนดการใช้งานและอาจส่งผลให้มีการยกเลิกหรือระงับสิทธิ์ขอ" +
        "งคุณในการใช้ Women-in-tech." +
        "<h4>ใบอนุญาตผลงาน</h4>" +
        "คุณและ Women-in-tech ตกลงว่าเราสามารถ เข้าถึง จัดเก็บ ประมวลผล และใช้ข้อมูลและข้อมูลส่วนบุคคลใดๆ ที่คุณให้ไว้ตามเงื่อนไขของนโยบายความเป็นส่วนตัวและการเลือกของคุณ (รวมถึงการตั้งค่า)" +
        "ในการส่งคำแนะนำหรือข้อเสนอแนะใดๆ ที่เกี่ยวข้องกับ Women-in-tech คุณยินยอมให้เราสามารถใช้และแบ่งปันข้อเสนอแนะไม่ว่าเพื่อวัตถุประสงค์ใดๆ โดยไม่ต้องได้รับความยินยอมและ/หรือตอบแทนคุณ" +
        "<br><br>"+
        "ทั้งนี้ เราจะไม่ยืนยันความเป็นเจ้าของในผลงานของคุณ โดยที่คุณยังคงเป็นเจ้าของผลงานทั้งหมดตามสิทธิ์ในทรัพย์สินทางปัญญาหรือกรรมสิทธิ์อื่นๆ ที่เกี่ยวข้อง" +
        "<br><br>" +
        "อนึ่ง เราไม่รับผิดชอบต่อข้อความหรือการรับรองใดๆ ในผลงานของคุณที่คุณได้สร้างไว้บนพื้นที่ใดๆ บน Women-in-tech คุณมีหน้าที่รับผิดชอบแต่เพียงผู้" +
        "เดียว โดยที่คุณตกลงที่จะละเว้นเราจากความรับผิดชอบใดๆ  และงดเว้นการดำเนินคดีใดๆ ทางกฎหมายกับเราที่เกี่ยวข้องกับผลงานของคุณ" +
        "<h4>ใบอนุญาตแอปพลิเคชันมือถือ</h4>" +
        "การใช้ใบอนุญาต" +
        "<br><br>" +
        "ในกรณีคุณเข้าถึง Women-in-tech ผ่านแอปพลิเคชันมือถือ เราให้สิทธิ์แก่คุณในการติดตั้งและใช้แอปพลิเคชันมือถือบนอุปกรณ์อิเล็กทรอนิกส์ไร้สายที่คุณเป็นเ" +
        "จ้าของหรือควบคุม" +
        "<br><br>" +
        "โดยจะต้องเข้าถึงและใช้แอปพลิเคชันมือถือบนอุปกรณ์ดังกล่าวอย่างเคร่งครัดตามข้อกำหนดและเงื่อนไขของใบอนุญาตแอปพลิเคชันมือถือ" +
        "ในข้อกำหนดการใช้งาน โดยคุณต้องไม่ดำเนินการ (1) ถอดรหัส วิศวกรรมย้อนกลับ แยกส่วน พยายามหาซอร์สโค้ด หรือถอดรหัสแอปพลิเคชัน (2) " +
        "ทำการปรับเปลี่ยน ดัดแปลง ปรับปรุง ปรับปรุง แปล หรือลอกเลียนแบบงานใดๆ จากแอปพลิเคชัน (3) ละเมิดกฎหมาย กฎ หรือข้อบังคับที่เกี่ยวข้องกับก" +
        "ารเข้าถึงหรือการใช้แอปพลิเคชัน (4) ลบ เปลี่ยนแปลง หรือปิดบังประกาศกรรมสิทธิ์ใดๆ (รวมถึงประกาศเกี่ยวกับลิขสิทธิ์หรือเครื่องหมายการค้า) " +
        "ที่โพสต์โดยบริษัทหรือผู้อนุญาตบนแอปพลิเคชัน (5) ใช้แอปพลิเคชันในทางพยายามสร้างรายได้ ประกอบการค้าหรือวัตถุประสงค์อื่นที่ไม่ได้ตั้งใจออกแบบไว้ " +
        "(6) ทำให้แอปพลิเคชันใช้งานนอกเหนือเครือข่ายและในสภาพแวดล้อมอื่นใดที่อนุญาตให้เข้าถึง หรือใช้งานโดยอุปกรณ์หรือผู้ใช้หลายเครื่องในเวลาเดียวกัน " +
        "(7) ใช้แอปพลิเคชันเพื่อสร้างผลิตภัณฑ์ บริการ หรือซอฟต์แวร์ที่แข่งขันทั้งโดยตรงหรือโดยอ้อมไม่ว่าทางใดทางหนึ่ง (8) " +
        "ใช้แอปพลิเคชันเพื่อส่งคำถามอัตโนมัติไปยังเว็บ Women-in-tech หรือส่งอีเมลเชิงพาณิชย์ที่ไม่พึงประสงค์ หรือ (9) " +
        "ใช้ข้อมูลที่เป็นกรรมสิทธิ์หรือส่วนต่อประสานใดๆ ของบริษัท หรือที่เป็นทรัพย์สินทางปัญญาของบริษัทในการออกแบบ พัฒนา ผลิต อนุญาต " +
        "หรือแจกจ่ายแอปพลิเคชัน อุปกรณ์เสริม หรือกับอุปกรณ์ใดๆ สำหรับใช้กับแอปพลิเคชัน" +
        "<br><br>" +
        "อุปกรณ์ Apple และ Android" +
        "<br><br>" +
        "ข้อกำหนดต่อไปนี้มีผลบังคับใช้เมื่อคุณใช้แอปพลิเคชันมือถือที่ได้รับจาก Apple Store หรือ Google Play (รวมเรียกว่า \"ผู้จัดจำหน่ายแอป\") " +
        "เพื่อเข้าถึง Women-in-tech  (1) ใบอนุญาตของเราที่คุณได้รับเพื่อใช้งานบนแอปพลิเคชันมือถือจำกัดสิทธิ์การใช้งานไม่สามารถถ่ายโอน " +
        "การใช้แอปพลิเคชันบนอุปกรณ์ที่ใช้ระบบปฏิบัติการ Apple iOS หรือ Android อันเป็นไปตามความเหมาะสมและเป็นไปตามกฎการใช้งานที่กำหนดไ" +
        "ว้ในข้อกำหนดการให้บริการของผู้จัดจำหน่ายแอปที่เกี่ยวข้อง (2) เรามีหน้าที่รับผิดชอบให้บริการบำรุงรักษาและสนับสนุนใด ๆ ที่เกี่ยวกับแอปพลิเคชันมือถื" +
        "อตามที่ระบุไว้ในข้อกำหนดและเงื่อนไขของใบอนุญาตแอปพลิเคชันมือถืออันเป็นไปตามข้อกำหนดการใช้งานหรือตามที่กฎหมายกำหนด โดยคุณรับทราบว่าผู้จัด" +
        "จำหน่ายแอป (App Distributor) ไม่มีภาระผูกพันใด ๆ ในการจัดหาบริการบำรุงรักษาและสนับสนุนเกี่ยวกับแอปพลิเคชันมือถือ (3) ในกรณีหากเกิดค" +
        "วามล้มเหลวของแอปพลิเคชั่นมือถือ เพื่อให้สอดคล้องกับการรับประกันใดๆ คุณสามารถแจ้งผู้จัดจำหน่ายแอพซึ่งเป็นไปตามข้อกำหนดและนโยบายของผู้จัดจำ" +
        "หน่ายแอปโดยอาจคืนเงินราคาซื้อ (หากมี) ที่ได้ชำระเงินสำหรับแอปพลิเคชันมือถือในอัตราสูงสุดที่บัญญัติไว้ในกฎหมาย โดยที่ผู้จัดจำหน่ายแอป " +
        "(App Distributor) จะไม่มีภาระผูกพันในการรับประกันใดๆ ที่เกี่ยวกับแอปพลิเคชันมือถือ " +
        "(4) คุณรับรองและรับประกันว่า (i) คุณไม่ได้อยู่ในประเทศที่อยู่ภายใต้การคว่ำบาตรของรัฐบาลสหรัฐฯ หรือที่รัฐบาลสหรัฐฯ กำหนดให้เป็นประเทศ " +
        "\"สนับสนุนผู้ก่อการร้าย\" และ (ii) คุณไม่ได้อยู่ในรายชื่อบุคคลที่ต้องห้ามหรือถูกจำกัดของรัฐบาลสหรัฐฯ (5) คุณต้องปฏิบัติตามข้อกำหนดในข้อตกลงขอ" +
        "งบุคคลอื่นที่เกี่ยวข้องเมื่อใช้งานแอปพลิเคชันมือถือ เช่น หากคุณมีแอปพลิเคชัน VoIP คุณจะต้องไม่ละเมิดข้อตกลงบริการข้อมูลไร้สายของแอปพลิเคชันนั้นๆ" +
        " เมื่อมีการใช้แอปพลิเคชันมือถือ และ (6) คุณรับทราบและตกลงว่า ผู้จัดจำหน่ายแอป (App Distributor) เป็นเป็นบุคคลที่สามซึ่งรับประโยชน์ตามข้อ" +
        "กำหนดและเงื่อนไขในใบอนุญาตแอปพลิเคชันมือถือที่มีอยู่ในข้อกำหนดการใช้งานนั้นๆ และผู้จัดจำหน่ายแอป (App Distributor) แต่ละรายมีสิทธิ์ " +
        "(และถือว่าได้รับสิทธิ์) บังคับใช้ข้อกำหนดและเงื่อนไขตามใบอนุญาตแอปพลิเคชันมือถือที่อยู่ในข้อกำหนดการใช้งานกับคุณในฐานะผู้รับผลประโยชน์ซึ่งเป็นบุคคลที่สาม" +
        "<br><br>" +
        "สิ่งที่ส่งมา" +
        "<br><br>" +
        "คุณรับทราบและตกลงว่าหากเกิดคำถาม ข้อคิดเห็น คำแนะนำ แนวคิด ข้อเสนอแนะ หรือข้อมูลอื่น ๆ เกี่ยวกับ Women-in-tech " +
        "(รวมเรียกว่า \"สิ่งที่ส่งมา\") ซึ่งคุณให้กับเรานั้นจะไม่ถือว่าเป็นความลับและนับว่าเป็นทรัพย์สินของเรา โดยทางเราเป็นเจ้าของสิทธิ์รวมถึงสิทธิ์ในทรัพ" +
        "ย์สินทางปัญญาทั้งหมดแต่เพียงผู้เดียว และจะมีสิทธิ์ในการใช้งานและเผยแพร่ข้อมูลเพื่อวัตถุประสงค์ที่ชอบด้วยกฎหมาย เชิงพาณิชย์หรืออื่นใดโดยไม่ต้องแจ้ง" +
        "ให้ทราบหรือชดเชยให้กับคุณ คุณได้สละสิทธิ์ทางศีลธรรมทั้งหมดในการส่งข้อมูลดังกล่าว และคุณรับประกันว่าสิ่งที่ส่งมานั้นเป็นต้นฉบับของคุณหรือคุณมีสิทธิ์ที่จะ" +
        "ส่งมา คุณตกลงว่าจะไม่มีการไล่เบี้ยจากเราสำหรับการกล่าวหาหรือการละเมิด หรือการยักยอกกรรมสิทธิ์ในการส่งข้อมูลของคุณ" +
        "<h4>การบริหารจัดการ WOMEN-IN-TECH</h4>" +
        "เราขอสงวนสิทธิ์แต่ไม่ผูกมัดในการ (1) ตรวจสอบ Women-in-tech ในกรณีมีการละเมิดข้อกำหนดการใช้งาน (2) ใช้ดุลยพินิจดำเนินการทางกฎหมาย" +
        "กับผู้ละเมิดกฎหมายหรือข้อกำหนดการใช้ ซึ่งรวมถึงแต่ไม่จำกัดเพียงการรายงานผู้ใช้ดังกล่าวต่อหน่วยงานที่บังคับใช้กฎหมาย (3) ใช้ดุลยพินิจของเราแต่เ" +
        "พียงผู้เดียวดำเนินการซึ่งไม่จำกัดเพียงแต่การปฏิเสธ การจำกัดการเข้าถึง การจำกัดความพร้อมใช้งาน หรือการปิดใช้งาน " +
        "(ในขอบเขตที่เป็นไปได้ทางเทคโนโลยี) ในการดำเนินการต่อผลงานของคุณหรือส่วนใดส่วนหนึ่งที่เกี่ยวข้อง (4) ใช้ดุลยพินิจของเราแต่เพียงผู้เดียวดำเนิ" +
        "นการซึ่งไม่จำกัดเพียงแต่การจำกัด การแจ้ง หรือตามความรับผิดในการลบออกจาก Women-in-tech หรือปิดการใช้งานข้อมูลและเนื้อหาทั้งหมดที่มีขนาด" +
        "มากเกินไปหรือเป็นภาระต่อระบบในทางใดทางหนึ่ง และ (5) การจัดการโดย Women-in-tech เป็นไปเพื่อปกป้องสิทธิ์และทรัพย์สินของเราและเพื่ออำ" +
        "นวยความสะดวกในการทำงานที่เหมาะสมของ" +
        "<h4>ข้อกำหนดการใช้งานและการยุติการใช้งาน</h4>" +
        "ข้อกำหนดการใช้งานจะยังคงมีผลบังคับใช้อย่างสมบูรณ์ในขณะที่คุณใช้ Women-In-Tech รวมถึงข้อกำหนดอื่นใดของข้อกำหนดการใช้งานอย่างไม่ถูกจำกัด " +
        "เราแต่เพียงผู้เดียวขอสงวนสิทธิ์ในการใช้ดุลยพินิจไม่รับผิดชอบหรือแจ้งล่วงหน้าในการปฏิเสธการเข้าถึงการใช้งานของ Women-In-Tech  " +
        "(รวมถึงการปิดกั้นที่อยู่ IP บางรายการ) แก่บุคคลใดๆ ด้วยเหตุผลใดๆ ซึ่งรวมถึงแต่ไม่จำกัดเพียงการกระทำที่ละเมิดการรับรอง การรับประกัน " +
        "หรือข้อตกลงใดๆ ที่มีอยู่ในข้อตกลงการใช้งาน หรือตามกฎหมาย หรือข้อบังคับที่เกี่ยวข้อง โดยเราสามารถใช้ดุลยพินิจยุติการใช้งานหรือการมีส่วนร่วมใน " +
        "Women-In-Tech หรือลบบัญชีของคุณรวมถึงเนื้อหาหรือข้อมูลใดๆ ที่คุณโพสต์ได้ทุกเมื่อโดยไม่ต้องแจ้งเตือน" +
        "<br><br>" +
        "หากเรายุติหรือระงับบัญชีของคุณด้วยเหตุผลใดๆ ก็ตาม ห้ามมิให้คุณลงทะเบียนและสร้างบัญชีใหม่โดยใช้ชื่อของคุณ ชื่อปลอมหรือชื่อที่ยืมมา " +
        "หรือชื่อของบุคคลอื่นแม้ว่าคุณอาจดำเนินการในนามของบุคคลอื่น ซึ่งนอกจากการยกเลิกหรือระงับบัญชีของคุณแล้ว เราขอสงวนสิทธิ์ในการดำเนินการทางก" +
        "ฎหมายที่เหมาะสม รวมถึงแต่ไม่จำกัดเพียงการดำเนินการชดใช้ทางแพ่ง ทางอาญา และการชดใช้ตามคำสั่งห้าม" +
        "<h4>การปรับเปลี่ยนและการชะงักการใช้งาน</h4>" +
        "เราแต่เพียงผู้เดียวขอสงวนสิทธิ์ใช้ดุลยพินิจในการเปลี่ยนแปลง แก้ไข หรือลบเนื้อหาใน Women-in-tech ได้ตลอดเวลาด้วยเหตุผลใดก็ตามโดยไม่ต้องแ" +
        "จ้งให้ทราบ อย่างไรก็ตามเราไม่มีภาระผูกพันในการปรับปรุงข้อมูลใดๆ บน Women-in-tech เราขอสงวนสิทธิ์ในการแก้ไขหรือยกเลิก " +
        "Women-in-tech ทั้งหมดหรือบางส่วนโดยไม่ต้องแจ้งให้ทราบโดยไม่ต้องรับผิดชอบต่อคุณหรือบุคคลอื่นสำหรับการปรับเปลี่ยน รวมถึงการเปลี่ยนแปลงราคา " +
        "การระงับ หรือการหยุดให้บริการ Women-in-tech. เราไม่สามารถรับประกันได้ว่า Women-in-tech จะพร้อมใช้งานตลอดเวลา โดยทางเราอาจปร" +
        "ะสบปัญหาเกี่ยวกับฮาร์ดแวร์ ซอฟต์แวร์ หรือปัญหาอื่นๆ หรือจำเป็นต้องดำเนินการบำรุงรักษาที่เกี่ยวข้องกับ Women-in-tech ส่งผลให้เกิดการหยุดชะงัก " +
        "เกิดความล่าช้าหรือข้อผิดพลาด เราขอสงวนสิทธิ์ในการเปลี่ยนแปลง แก้ไข ปรับปรุง ระงับ ยุติ หรือแก้ไข Women-in-tech ได้ตลอดเวลาไม่ว่าด้วยเ" +
        "หตุผลใดๆ โดยไม่ต้องแจ้งให้ทราบ โดยคุณยอมรับว่าเราไม่มีความรับผิดใดๆ สำหรับการสูญเสีย ความเสียหาย หรือความไม่สะดวกใดๆ ที่เกิดจากการที่" +
        "คุณไม่สามารถเข้าถึงหรือใช้ Women-in-tech ในช่วงเวลาหยุดทำงานหรือการหยุดทำงานของ Women-in-tech อย่างไม่มีสิ่งใดในข้อกำหนดการใช้ง" +
        "านจะสามารถใช้ตีความเพื่อบังคับให้เราคงสภาพการรักษา สนับสนุน หรือเพื่อจัดหาการแก้ไข ปรับปรุง หรือเผยแพร่สิ่งอื่นใดที่เกี่ยวข้องกับ Women-in-tech" +
        "<h4>กฎหมายที่บังคับใช้</h4>" +
        "ข้อกำหนดเหล่านี้อยู่ภายใต้กฎหมายของประเทศมาเลเซีย" +
        "<h4>การระงับข้อพิพาท</h4>" +
        "คุณตกลงที่จะยื่นข้อพิพาททั้งหมดที่เกี่ยวข้องกับข้อกำหนดการใช้งานนี้ในเขตอำนาจศาลของประเทศมาเลเซีย" +
        "<h4>การแก้ไข</h4>" +
        "หากข้อมูลบน Women-in-tech มีข้อผิดพลาดในการพิมพ์ ไม่ถูกต้อง หรือมีการละเว้น รวมถึงข้อผิดพลาดคำอธิบาย ราคาที่จำหน่าย รวมถึงข้อมูลอื่นๆ " +
        "เราขอสงวนสิทธิ์ในการแก้ไขข้อผิดพลาดความไม่ถูกต้อง หรือการละเว้นใดๆ ในการเปลี่ยนแปลงหรือปรับปรุงข้อมูลบน Women-in-tech ได้ตลอดเวลา" +
        "โดยไม่ต้องแจ้งให้ทราบล่วงหน้า" +
        "<h4>การปฏิเสธรับผิดชอบต่อข้อเรียกร้อง</h4>" +
        "การใช้งาน WOMEN-IN-TECH มีให้ตามสภาพที่เป็นอยู่และตามที่มีอยู่ คุณตกลงว่าการใช้งาน WOMEN-IN-TECH และการใช้บริการของเราอยู่ภายใต้ความ" +
        "เสี่ยงของคุณแต่เพียงผู้เดียว ทั้งนี้ในขอบเขตอำนาจตามกฎหมายเราขอปฏิเสธการรับประกันทั้งหมดไม่ว่าโดยชัดแจ้งหรือโดยนัยในส่วนที่เกี่เกี่ยวข้องกับการ" +
        "ใช้งาน WOMEN-IN-TECH และการไม่ละเมิดลิขสิทธิ์คุณ เราไม่รับประกันหรือรับรองความถูกต้องหรือความสมบูรณ์ของการใช้งานเนื้อหา หรือเนื้อหาของเว็บ " +
        "WOMEN-IN-TECH หรือที่เชื่อมโยงกับ WOMEN-IN-TECH โดยเราจะไม่รับผิดชอบต่อ" +
        "(1) ข้อผิดพลาด ข้อบกพร่อง หรือความไม่ถูกต้องของเนื้อหาและเครื่องมือวัสดุ (2) การได้รับความเสียหายต่อร่างกายและทางทรัพย์สินหรือความเสียหา" +
        "ยอื่นใด อันเป็นผลมาจากการเข้าถึงและการใช้งาน WOMEN-IN-TECH (4) การหยุดชะงักการใช้งานหรือหรือการหยุดชะงักของการส่งต่อที่เกี่ยวข้องกับ " +
        "WOMEN-IN-TECH (5) ไม่ว่าจะเป็น บั๊ก ไวรัส ไวรัสม้าโทรจัน หรืออื่นๆ คล้ายเคียงกัน ที่ถูกส่งต่อไปหรือผ่าน WOMEN-IN-TECH โดยบุคคลอื่น " +
        "และ/หรือ (6) ข้อผิดพลาดหรือการละเว้นในเนื้อหาและวัสดุใดๆ สำหรับความสูญเสียความเสียหาย ที่เกิดขึ้นอันเป็นผลมาจากการใช้เนื้อหา การโพสต์ " +
        "การส่ง หรือการกระทำอื่นใดที่ผ่าน WOMEN-IN-TECH เราไม่รับประกัน รับรอง หรือรับผิดชอบต่อผลิตภัณฑ์ หรือรับผิดชอบต่อบริการใดๆ ที่โฆษณาหรือเสนอ" +
        "โดยบุคคลที่อื่นผ่านทาง WOMEN-IN-TECH รวมไปถึง เว็บ WOMEN-IN-TECH ไฮเปอร์ลิงก์ หรือแอปพลิเคชั่นมือถือที่มีแบนเนอร์หรือโฆษณาอื่นๆ โดยเร" +
        "าจะไม่เป็นคู่สัญญาหรือรับผิดชอบในการตรวจสอบธุรกรรมใดๆ ระหว่างคุณและผู้ให้บริการผลิตภัณฑ์หรือบริการที่เป็นบุคคลอื่น เช่นเดียวกับการซื้อผลิตภัณฑ์หรื" +
        "อบริการผ่านสื่อหรือในสภาพแวดล้อมใดๆ ที่คุณควรใช้วิจารณญาณและความระมัดระวังในการกระทำการดๆ ตามความเหมาะสม" +
        "<h4>การจำกัดความรับผิดชอบ</h4>" +
        "ไม่ว่าในกรณีใดๆ เราหรือกรรมการ พนักงาน หรือตัวแทนของเรา ซึ่งรวมถึงบริษัทในเครือและบริษัทย่อยจะไม่รับผิดต่อคุณหรือบุคคลภายนอกต่อความเสียห" +
        "ายทั้งทางตรง ทางอ้อม ความเสียหายที่เป็นผลสืบเนื่อง หรือค่าเสียหายอันเป็นความเสียหายที่เกิดขึ้นโดยบังเอิญ ค่าเสียหายพิเศษหรือค่าเสียหายจากกา" +
        "รลงโทษรวมถึงการสูญเสียผลกำไร การสูญเสียรายได้ การสูญเสียข้อมูล หรือความเสียหายอื่น ๆ ที่เกิดขึ้นจากการใช้  WOMEN-IN-TECH" +
        "<b>แม้ว่าเราจะได้รับแจ้งถึงความเป็นไปได้ของความเสียหายดังกล่าวแล้วก็ตาม</b>" +
        "<h4>การชดใช้ค่าเสียหาย</h4>" +
        "คุณตกลงที่จะปกป้อง ชดใช้ค่าเสียหาย และปกป้องเราจากอันตรายใดๆ รวมถึงสำนักงาน พนักงาน ตัวแทน คู่ค้าของเราจากความสูญเสีย ความเสียหาย " +
        "ความรับผิด ข้อเรียกร้อง หรือความต้องการใดๆ รวมถึงค่าธรรมเนียมและค่าใช้จ่ายตามกฎหมายที่เกิดขึ้นจากการกระทำของบุคคลอื่น อันเป็นเหตุเนื่อ" +
        "งมาจาก (1) การใช้ Women-in-tech (2 ) การละเมิดเงื่อนไขการใช้งาน (3) การฝ่าฝืนการรับรองและการรับประกันของคุณที่กำหนดไว้ในข้อกำ" +
        "หนดการใช้งาน (4) การละเมิดสิทธิ์ของบุคคลอื่นซึ่งรวมถึงแต่ไม่จำกัดเพียงสิทธิ์ในทรัพย์สินทางปัญญา หรือ (5) การกระทำที่เป็นอันตรายต่อการใช้งาน " +
        "Women-in-tech กับคนที่คุณเชื่อมต่อผ่าน Women-in-tech โดยไม่คำนึงถึงสิ่งที่กล่าวมาข้างต้น โดยเราขอสงวนสิทธิ์ค่าใช้จ่ายของคุณเพื่อป้องกันและค" +
        "วบคุมไม่ว่าเรื่องใดๆ ที่คุณต้องชดใช้ค่าเสียหายแก่เรา และคุณตกลงที่จะให้ความร่วมมือในภาระค่าใช้จ่ายของคุณ พร้อมกับแก้ต่างข้อเรียกร้องใดๆ " +
        "โดยเราจะดำเนินการตามสมควรเพื่อแจ้งให้คุณทราบถึงข้อเรียกร้อง หรือการดำเนินการใดๆ ซึ่งอยู่ภายใต้การชดใช้ค่าเสียหายนี้เมื่อทราบ" +
        "<h4>ข้อมูลผู้ใช้</h4>" +
        "เราจะเก็บรักษาข้อมูลบางส่วนที่คุณส่งไปยัง Women-in-tech เพื่อวัตถุประสงค์ในการจัดการประสิทธิภาพของ Women-in-tech รวมถึงข้อมูลของคุณที่เ" +
        "กี่ยวข้องกับการใช้งาน Women-in-tech แม้ว่าจะมีการสำรองข้อมูลตามปกติอยู่เป็นประจำ คุณมีหน้าที่รับผิดชอบแต่เพียงผู้เดียวสำหรับข้อมูลทั้งหมดที่ได้มีก" +
        "ารส่งหรือที่เกี่ยวข้องกับกิจกรรมใดๆ ที่คุณดำเนินการโดยใช้ Women-in-tech คุณตกลงว่าเราไม่มีความรับผิดต่อคุณสำหรับการสูญเสียหรือความเสียหายข" +
        "องข้อมูลดังกล่าว และคุณขอละเว้นการดำเนินการใดๆ กับเราจากความสูญเสียหรือความเสียหายที่เกิดขึ้นกับข้อมูล" +
        "<h4>การสื่อสารทางอิเล็กทรอนิกส์ ธุรกรรม และลายมือชื่อ</h4>" +
        "การกระทำอันเป็นการการเยี่ยมชม Women-in-tech การส่งอีเมลถึงเรา และกรอกแบบฟอร์มออนไลน์ถือเป็นการสื่อสารทางอิเล็กทรอนิกส์ " +
        "คุณยินยอมที่จะรับการสื่อสารทางอิเล็กทรอนิกส์ และคุณตกลงในข้อตกลง การแจ้งเตือน การเปิดเผย และการสื่อสารอื่นๆ ทั้งหมดที่ส่งแก่คุณทางอิเล็กทรอ" +
        "นิกส์ผ่านอีเมลและบน Women-in-tech ซึ่งเป็นไปตามข้อกำหนดทางกฎหมาย โดยที่การสื่อสารต้องดำเนินการเป็นลายลักษณ์อักษร คุณตกลงที่จะใช้ลายเ" +
        "ซ็นอิเล็กทรอนิกส์ สัญญา คำสั่งซื้อ และบันทึกอื่น ๆ และในการส่งประกาศ นโยบาย และบันทึกธุรกรรมที่ริเริ่มหรือดำเนินการโดยเราหรือผ่านทาง " +
        "WOMEN-IN-TECH" +
        "<h4>เบ็ดเตล็ด</h4>" +
        "ข้อกำหนดการใช้งานเและนโยบายหรือกฎการดำเนินงานใดๆ ที่เราโพสต์บน Women-in-tech หรือในส่วนที่เกี่ยวกับ Women-in-tech ถือเป็นข้อตกล" +
        "งและความเข้าใจทั้งหมดระหว่างคุณกับเรา ความล้มเหลวของเราในการใช้หรือบังคับใช้สิทธิ์ในข้อกำหนดใดๆ หรือบทบัญญัติใดๆ ในข้อกำหนดการใช้งานจ" +
        "ะไม่ถือว่าเป็นการละเว้นการดำเนินการตามสิทธิหรือบทบัญญัติ ในทางสูงสุดข้อกำหนดการใช้งานให้ถือว่าเป็นไปตามข้อบัญญัติตามกฎหมาย เราอาจมอบสิทธิ์" +
        "และภาระผูกพันต่อผู้อื่นในการดำเนินการได้ตลอดเวลา เราจะไม่รับผิดชอบหรือรับผิดต่อความสูญเสีย ความเสียหาย ความล่าช้า หรือความล้มเหลวในกา" +
        "รดำเนินการใด ๆ ที่เกิดจากสาเหตุใดๆ ที่อยู่นอกเหนือการควบคุมอย่างเหมาะสมของเรา หากบทบัญญัติหรือส่วนหนึ่งส่วนใดของข้อกำหนดการใช้งานเหล่" +
        "านี้ได้รับการพิจารณาว่าไม่ชอบด้วยกฎหมาย เป็นโมฆะ หรือไม่สามารถบังคับใช้ได้ ให้ถือว่าส่วนใดส่วนหนึ่งของข้อกำหนดนี้แยกออกจากข้อกำหนดการใช้ง" +
        "าน และจะไม่กระทบต่อความถูกต้องและการบังคับใช้ของข้อกำหนดในส่วนที่เหลือ ทั้งนี้จะไม่มีการร่วมทุน หุ้นส่วน การจ้างงานหรือความสัมพันธ์ตัวแทนที่สร้" +
        "างขึ้นระหว่างคุณและเราอันเป็นผลมาจากข้อกำหนดการหรือการใช้งาน Women-in-tech คุณตกลงว่าข้อตกลงการใช้งานจะไม่ถูกตีความอันเป็นผลร้ายกับ" +
        "เราโดยอาศัยตามอำนาจที่ได้ร่างไว้นี้"

    firebase.firestore().collection("TermsOfUse").doc("TermsOfUse_th").set({
        contents: contents
    })
        .then(() => {
            console.log("Document successfully written!");
        })
        .catch((error) => {
            console.error("Error writing document: ", error);
        });
}